TexasInstruments/mcal_am263x/mcal/FsiTx/V0/Cdd_FsiTx_Reg.h
/*
 * TEXAS INSTRUMENTS TEXT FILE LICENSE
 *
 * Copyright (c) 2023 Texas Instruments Incorporated
 *
 * All rights reserved not granted herein.
 *
 * Limited License.
 *
 * Texas Instruments Incorporated grants a world-wide, royalty-free, non-exclusive
 * license under copyrights and patents it now or hereafter owns or controls to
 * make, have made, use, import, offer to sell and sell ("Utilize") this software
 * subject to the terms herein. With respect to the foregoing patent license,
 * such license is granted solely to the extent that any such patent is necessary
 * to Utilize the software alone. The patent license shall not apply to any
 * combinations which include this software, other than combinations with devices
 * manufactured by or for TI ("TI Devices"). No hardware patent is licensed hereunder.
 *
 * Redistributions must preserve existing copyright notices and reproduce this license
 * (including the above copyright notice and the disclaimer and (if applicable) source
 * code license limitations below) in the documentation and/or other materials provided
 * with the distribution.
 *
 * Redistribution and use in binary form, without modification, are permitted provided
 * that the following conditions are met:
 * No reverse engineering, decompilation, or disassembly of this software is
 * permitted with respect to any software provided in binary form.
 * Any redistribution and use are licensed by TI for use only with TI Devices.
 * Nothing shall obligate TI to provide you with source code for the software
 * licensed and provided to you in object code.
 *
 * If software source code is provided to you, modification and redistribution of the
 * source code are permitted provided that the following conditions are met:
 * Any redistribution and use of the source code, including any resulting derivative
 * works, are licensed by TI for use only with TI Devices.
 * Any redistribution and use of any object code compiled from the source code
 * and any resulting derivative works, are licensed by TI for use only with TI Devices.
 *
 * Neither the name of Texas Instruments Incorporated nor the names of its suppliers
 * may be used to endorse or promote products derived from this software without
 * specific prior written permission.
 *
 * DISCLAIMER.
 *
 * THIS SOFTWARE IS PROVIDED BY TI AND TI'S LICENSORS "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 * AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL TI AND TI'S
 * LICENSORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef CDD_FSI_TX_REG_H_
#define CDD_FSI_TX_REG_H_

#ifdef __cplusplus
extern "C" {
#endif

#include "Std_Types.h"

/**************************************************************************
 * Module Base Offset Values
 **************************************************************************/

#define CSL_CDD_FSI_TX_CFG_REGS_BASE (0x00000000U)

/**************************************************************************
 * Hardware Region  : CDD FSI TX Registers
 **************************************************************************/

/**************************************************************************
 * Register Overlay Structure
 **************************************************************************/

typedef struct
{
    volatile uint16 TX_MASTER_CTRL;
    volatile uint16 RESERVED_1;
    volatile uint16 TX_CLK_CTRL;
    volatile uint16 RESERVED_2;
    volatile uint16 TX_OPER_CTRL_LO_ALT1;
    volatile uint16 TX_OPER_CTRL_HI_ALT1;
    volatile uint16 TX_FRAME_CTRL;
    volatile uint16 TX_FRAME_TAG_UDATA;
    volatile uint16 TX_BUF_PTR_LOAD;
    volatile uint16 TX_BUF_PTR_STS;
    volatile uint16 TX_PING_CTRL_ALT1;
    volatile uint16 TX_PING_TAG;
    volatile uint32 TX_PING_TO_REF;
    volatile uint32 TX_PING_TO_CNT;
    volatile uint16 TX_INT_CTRL;
    volatile uint16 TX_DMA_CTRL;
    volatile uint16 TX_LOCK_CTRL;
    volatile uint16 RESERVED_3;
    volatile uint16 TX_EVT_STS;
    volatile uint16 RESERVED_4;
    volatile uint16 TX_EVT_CLR;
    volatile uint16 TX_EVT_FRC;
    volatile uint16 TX_USER_CRC;
    volatile uint16 RESERVED_5;
    volatile uint32 RESERVED_6;
    volatile uint32 RESERVED_7;
    volatile uint32 RESERVED_8;
    volatile uint32 TX_ECC_DATA;
    volatile uint16 TX_ECC_VAL;
    volatile uint16 RESERVED_9;
    volatile uint16 TX_DLYLINE_CTRL;
    volatile uint16 RESERVED_10[24];
    volatile uint16 TX_BUF_BASE[16];
} CSL_cdd_fsi_tx_cfgRegs;

/**************************************************************************
 * Register Macros
 **************************************************************************/

#define CSL_CDD_FSI_TX_CFG_TX_MASTER_CTRL           (0x00000000U)
#define CSL_CDD_FSI_TX_CFG_RESERVED_1               (0x00000002U)
#define CSL_CDD_FSI_TX_CFG_TX_CLK_CTRL              (0x00000004U)
#define CSL_CDD_FSI_TX_CFG_RESERVED_2               (0x00000006U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1     (0x00000008U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_HI_ALT1     (0x0000000AU)
#define CSL_CDD_FSI_TX_CFG_TX_FRAME_CTRL            (0x0000000CU)
#define CSL_CDD_FSI_TX_CFG_TX_FRAME_TAG_UDATA       (0x0000000EU)
#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_LOAD          (0x00000010U)
#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_STS           (0x00000012U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_CTRL_ALT1        (0x00000014U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_TAG              (0x00000016U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_TO_REF           (0x00000018U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_TO_CNT           (0x0000001CU)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL              (0x00000020U)
#define CSL_CDD_FSI_TX_CFG_TX_DMA_CTRL              (0x00000022U)
#define CSL_CDD_FSI_TX_CFG_TX_LOCK_CTRL             (0x00000024U)
#define CSL_CDD_FSI_TX_CFG_RESERVED_3               (0x00000026U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_STS               (0x00000028U)
#define CSL_CDD_FSI_TX_CFG_RESERVED_4               (0x0000002AU)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_CLR               (0x0000002CU)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_FRC               (0x0000002EU)
#define CSL_CDD_FSI_TX_CFG_TX_USER_CRC              (0x00000030U)
#define CSL_CDD_FSI_TX_CFG_RESERVED_5               (0x00000032U)
#define CSL_CDD_FSI_TX_CFG_RESERVED_6               (0x00000034U)
#define CSL_CDD_FSI_TX_CFG_RESERVED_7               (0x00000038U)
#define CSL_CDD_FSI_TX_CFG_RESERVED_8               (0x0000003CU)
#define CSL_CDD_FSI_TX_CFG_TX_ECC_DATA              (0x00000040U)
#define CSL_CDD_FSI_TX_CFG_TX_ECC_VAL               (0x00000044U)
#define CSL_CDD_FSI_TX_CFG_RESERVED_9               (0x00000046U)
#define CSL_CDD_FSI_TX_CFG_TX_DLYLINE_CTRL          (0x00000048U)
#define CSL_CDD_FSI_TX_CFG_RESERVED_10(RESERVED_10) (0x00000050U + ((RESERVED_10) * 0x2U))
#define CSL_CDD_FSI_TX_CFG_TX_BUF_BASE(TX_BUF_BASE) (0x00000080U + ((TX_BUF_BASE) * 0x2U))

/**************************************************************************
 * Field Definition Macros
 **************************************************************************/

/* CDD_FSI_TX_MASTER_CTRL */

#define CSL_CDD_FSI_TX_CFG_TX_MASTER_CTRL_CORE_RST_MASK  (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_MASTER_CTRL_CORE_RST_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_MASTER_CTRL_CORE_RST_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_MASTER_CTRL_FLUSH_MASK  (0x0002U)
#define CSL_CDD_FSI_TX_CFG_TX_MASTER_CTRL_FLUSH_SHIFT (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_MASTER_CTRL_FLUSH_MAX   (0x0001U)

