TexasInstruments/mcal_am263x/mcal/FsiTx/V0/Cdd_FsiTx_Reg.h
#define CSL_CDD_FSI_TX_CFG_TX_MASTER_CTRL_RESERVED_1_MASK  (0x00FCU)
#define CSL_CDD_FSI_TX_CFG_TX_MASTER_CTRL_RESERVED_1_SHIFT (0x0002U)
#define CSL_CDD_FSI_TX_CFG_TX_MASTER_CTRL_RESERVED_1_MAX   (0x003FU)

#define CSL_CDD_FSI_TX_CFG_TX_MASTER_CTRL_KEY_MASK  (0xFF00U)
#define CSL_CDD_FSI_TX_CFG_TX_MASTER_CTRL_KEY_SHIFT (0x0008U)
#define CSL_CDD_FSI_TX_CFG_TX_MASTER_CTRL_KEY_MAX   (0x00FFU)

/* RESERVED_1 */

/* CDD_FSI_TX_CLK_CTRL */

#define CSL_CDD_FSI_TX_CFG_TX_CLK_CTRL_CLK_RST_MASK  (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_CLK_CTRL_CLK_RST_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_CLK_CTRL_CLK_RST_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_CLK_CTRL_CLK_EN_MASK  (0x0002U)
#define CSL_CDD_FSI_TX_CFG_TX_CLK_CTRL_CLK_EN_SHIFT (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_CLK_CTRL_CLK_EN_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_CLK_CTRL_PRESCALE_VAL_MASK  (0x03FCU)
#define CSL_CDD_FSI_TX_CFG_TX_CLK_CTRL_PRESCALE_VAL_SHIFT (0x0002U)
#define CSL_CDD_FSI_TX_CFG_TX_CLK_CTRL_PRESCALE_VAL_MAX   (0x00FFU)

#define CSL_CDD_FSI_TX_CFG_TX_CLK_CTRL_RESERVED_1_MASK  (0xFC00U)
#define CSL_CDD_FSI_TX_CFG_TX_CLK_CTRL_RESERVED_1_SHIFT (0x000AU)
#define CSL_CDD_FSI_TX_CFG_TX_CLK_CTRL_RESERVED_1_MAX   (0x003FU)

/* RESERVED_2 */

/* CDD_FSI_TX_OPER_CTRL_LO_ALT1 */

#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_DATA_WIDTH_MASK  (0x0003U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_DATA_WIDTH_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_DATA_WIDTH_MAX   (0x0003U)

#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_SPI_MODE_MASK  (0x0004U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_SPI_MODE_SHIFT (0x0002U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_SPI_MODE_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_START_MODE_MASK  (0x0038U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_START_MODE_SHIFT (0x0003U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_START_MODE_MAX   (0x0007U)

#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_SW_CRC_MASK  (0x0040U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_SW_CRC_SHIFT (0x0006U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_SW_CRC_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_PING_TO_MODE_MASK  (0x0080U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_PING_TO_MODE_SHIFT (0x0007U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_PING_TO_MODE_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_SEL_PLLCLK_MASK  (0x0100U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_SEL_PLLCLK_SHIFT (0x0008U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_SEL_PLLCLK_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_TDM_ENABLE_MASK  (0x0200U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_TDM_ENABLE_SHIFT (0x0009U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_TDM_ENABLE_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_SEL_TDM_IN_MASK  (0x0400U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_SEL_TDM_IN_SHIFT (0x000AU)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_SEL_TDM_IN_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_RESERVED_1_MASK  (0xF800U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_RESERVED_1_SHIFT (0x000BU)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_LO_ALT1_RESERVED_1_MAX   (0x001FU)

/* CDD_FSI_TX_OPER_CTRL_HI_ALT1 */

#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_HI_ALT1_RESERVED_1_MASK  (0x001FU)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_HI_ALT1_RESERVED_1_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_HI_ALT1_RESERVED_1_MAX   (0x001FU)

#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_HI_ALT1_FORCE_ERR_MASK  (0x0020U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_HI_ALT1_FORCE_ERR_SHIFT (0x0005U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_HI_ALT1_FORCE_ERR_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_HI_ALT1_ECC_SEL_MASK  (0x0040U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_HI_ALT1_ECC_SEL_SHIFT (0x0006U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_HI_ALT1_ECC_SEL_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_HI_ALT1_EXT_TRIG_SEL_MASK  (0x1F80U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_HI_ALT1_EXT_TRIG_SEL_SHIFT (0x0007U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_HI_ALT1_EXT_TRIG_SEL_MAX   (0x003FU)

#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_HI_ALT1_RESERVED_2_MASK  (0xE000U)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_HI_ALT1_RESERVED_2_SHIFT (0x000DU)
#define CSL_CDD_FSI_TX_CFG_TX_OPER_CTRL_HI_ALT1_RESERVED_2_MAX   (0x0007U)

/* CDD_FSI_TX_FRAME_CTRL */

#define CSL_CDD_FSI_TX_CFG_TX_FRAME_CTRL_FRAME_TYPE_MASK  (0x000FU)
#define CSL_CDD_FSI_TX_CFG_TX_FRAME_CTRL_FRAME_TYPE_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_FRAME_CTRL_FRAME_TYPE_MAX   (0x000FU)

#define CSL_CDD_FSI_TX_CFG_TX_FRAME_CTRL_N_WORDS_MASK  (0x00F0U)
#define CSL_CDD_FSI_TX_CFG_TX_FRAME_CTRL_N_WORDS_SHIFT (0x0004U)
#define CSL_CDD_FSI_TX_CFG_TX_FRAME_CTRL_N_WORDS_MAX   (0x000FU)

#define CSL_CDD_FSI_TX_CFG_TX_FRAME_CTRL_RESERVED_1_MASK  (0x7F00U)
#define CSL_CDD_FSI_TX_CFG_TX_FRAME_CTRL_RESERVED_1_SHIFT (0x0008U)
#define CSL_CDD_FSI_TX_CFG_TX_FRAME_CTRL_RESERVED_1_MAX   (0x007FU)

#define CSL_CDD_FSI_TX_CFG_TX_FRAME_CTRL_START_MASK  (0x8000U)
#define CSL_CDD_FSI_TX_CFG_TX_FRAME_CTRL_START_SHIFT (0x000FU)
#define CSL_CDD_FSI_TX_CFG_TX_FRAME_CTRL_START_MAX   (0x0001U)

/* CDD_FSI_TX_FRAME_TAG_UDATA */

#define CSL_CDD_FSI_TX_CFG_TX_FRAME_TAG_UDATA_FRAME_TAG_MASK  (0x000FU)
#define CSL_CDD_FSI_TX_CFG_TX_FRAME_TAG_UDATA_FRAME_TAG_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_FRAME_TAG_UDATA_FRAME_TAG_MAX   (0x000FU)

#define CSL_CDD_FSI_TX_CFG_TX_FRAME_TAG_UDATA_RESERVED_1_MASK  (0x00F0U)
#define CSL_CDD_FSI_TX_CFG_TX_FRAME_TAG_UDATA_RESERVED_1_SHIFT (0x0004U)
#define CSL_CDD_FSI_TX_CFG_TX_FRAME_TAG_UDATA_RESERVED_1_MAX   (0x000FU)

#define CSL_CDD_FSI_TX_CFG_TX_FRAME_TAG_UDATA_USER_DATA_MASK  (0xFF00U)
#define CSL_CDD_FSI_TX_CFG_TX_FRAME_TAG_UDATA_USER_DATA_SHIFT (0x0008U)
#define CSL_CDD_FSI_TX_CFG_TX_FRAME_TAG_UDATA_USER_DATA_MAX   (0x00FFU)

/* CDD_FSI_TX_BUF_PTR_LOAD */

#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_LOAD_BUF_PTR_LOAD_MASK  (0x000FU)
#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_LOAD_BUF_PTR_LOAD_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_LOAD_BUF_PTR_LOAD_MAX   (0x000FU)

#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_LOAD_RESERVED_1_MASK  (0xFFF0U)
#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_LOAD_RESERVED_1_SHIFT (0x0004U)
#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_LOAD_RESERVED_1_MAX   (0x0FFFU)

/* CDD_FSI_TX_BUF_PTR_STS */

