TexasInstruments/mcal_am263x/mcal/FsiTx/V0/Cdd_FsiTx_Reg.h
#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_STS_CURR_BUF_PTR_MASK  (0x000FU)
#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_STS_CURR_BUF_PTR_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_STS_CURR_BUF_PTR_MAX   (0x000FU)

#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_STS_RESERVED_1_MASK  (0x00F0U)
#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_STS_RESERVED_1_SHIFT (0x0004U)
#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_STS_RESERVED_1_MAX   (0x000FU)

#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_STS_CURR_WORD_CNT_MASK  (0x1F00U)
#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_STS_CURR_WORD_CNT_SHIFT (0x0008U)
#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_STS_CURR_WORD_CNT_MAX   (0x001FU)

#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_STS_RESERVED_2_MASK  (0xE000U)
#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_STS_RESERVED_2_SHIFT (0x000DU)
#define CSL_CDD_FSI_TX_CFG_TX_BUF_PTR_STS_RESERVED_2_MAX   (0x0007U)

/* CDD_FSI_TX_PING_CTRL_ALT1 */

#define CSL_CDD_FSI_TX_CFG_TX_PING_CTRL_ALT1_CNT_RST_MASK  (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_CTRL_ALT1_CNT_RST_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_CTRL_ALT1_CNT_RST_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_PING_CTRL_ALT1_TIMER_EN_MASK  (0x0002U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_CTRL_ALT1_TIMER_EN_SHIFT (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_CTRL_ALT1_TIMER_EN_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_PING_CTRL_ALT1_EXT_TRIG_EN_MASK  (0x0004U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_CTRL_ALT1_EXT_TRIG_EN_SHIFT (0x0002U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_CTRL_ALT1_EXT_TRIG_EN_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_PING_CTRL_ALT1_EXT_TRIG_SEL_MASK  (0x01F8U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_CTRL_ALT1_EXT_TRIG_SEL_SHIFT (0x0003U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_CTRL_ALT1_EXT_TRIG_SEL_MAX   (0x003FU)

#define CSL_CDD_FSI_TX_CFG_TX_PING_CTRL_ALT1_RESERVED_1_MASK  (0xFE00U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_CTRL_ALT1_RESERVED_1_SHIFT (0x0009U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_CTRL_ALT1_RESERVED_1_MAX   (0x007FU)

/* CDD_FSI_TX_PING_TAG */

#define CSL_CDD_FSI_TX_CFG_TX_PING_TAG_TAG_MASK  (0x000FU)
#define CSL_CDD_FSI_TX_CFG_TX_PING_TAG_TAG_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_TAG_TAG_MAX   (0x000FU)

#define CSL_CDD_FSI_TX_CFG_TX_PING_TAG_RESERVED_1_MASK  (0xFFF0U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_TAG_RESERVED_1_SHIFT (0x0004U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_TAG_RESERVED_1_MAX   (0x0FFFU)

/* CDD_FSI_TX_PING_TO_REF */

#define CSL_CDD_FSI_TX_CFG_TX_PING_TO_REF_TO_REF_MASK  (0xFFFFFFFFU)
#define CSL_CDD_FSI_TX_CFG_TX_PING_TO_REF_TO_REF_SHIFT (0x00000000U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_TO_REF_TO_REF_MAX   (0xFFFFFFFFU)

/* CDD_FSI_TX_PING_TO_CNT */

#define CSL_CDD_FSI_TX_CFG_TX_PING_TO_CNT_TO_CNT_MASK  (0xFFFFFFFFU)
#define CSL_CDD_FSI_TX_CFG_TX_PING_TO_CNT_TO_CNT_SHIFT (0x00000000U)
#define CSL_CDD_FSI_TX_CFG_TX_PING_TO_CNT_TO_CNT_MAX   (0xFFFFFFFFU)

/* CDD_FSI_TX_INT_CTRL */

#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT1_EN_FRAME_DONE_MASK  (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT1_EN_FRAME_DONE_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT1_EN_FRAME_DONE_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT1_EN_BUF_UNDERRUN_MASK  (0x0002U)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT1_EN_BUF_UNDERRUN_SHIFT (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT1_EN_BUF_UNDERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT1_EN_BUF_OVERRUN_MASK  (0x0004U)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT1_EN_BUF_OVERRUN_SHIFT (0x0002U)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT1_EN_BUF_OVERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT1_EN_PING_TO_MASK  (0x0008U)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT1_EN_PING_TO_SHIFT (0x0003U)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT1_EN_PING_TO_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_RESERVED_1_MASK  (0x00F0U)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_RESERVED_1_SHIFT (0x0004U)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_RESERVED_1_MAX   (0x000FU)

#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT2_EN_FRAME_DONE_MASK  (0x0100U)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT2_EN_FRAME_DONE_SHIFT (0x0008U)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT2_EN_FRAME_DONE_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT2_EN_BUF_UNDERRUN_MASK  (0x0200U)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT2_EN_BUF_UNDERRUN_SHIFT (0x0009U)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT2_EN_BUF_UNDERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT2_EN_BUF_OVERRUN_MASK  (0x0400U)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT2_EN_BUF_OVERRUN_SHIFT (0x000AU)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT2_EN_BUF_OVERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT2_EN_PING_TO_MASK  (0x0800U)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT2_EN_PING_TO_SHIFT (0x000BU)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_INT2_EN_PING_TO_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_RESERVED_2_MASK  (0xF000U)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_RESERVED_2_SHIFT (0x000CU)
#define CSL_CDD_FSI_TX_CFG_TX_INT_CTRL_RESERVED_2_MAX   (0x000FU)

/* CDD_FSI_TX_DMA_CTRL */

#define CSL_CDD_FSI_TX_CFG_TX_DMA_CTRL_DMA_EVT_EN_MASK  (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_DMA_CTRL_DMA_EVT_EN_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_DMA_CTRL_DMA_EVT_EN_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_DMA_CTRL_RESERVED_1_MASK  (0xFFFEU)
#define CSL_CDD_FSI_TX_CFG_TX_DMA_CTRL_RESERVED_1_SHIFT (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_DMA_CTRL_RESERVED_1_MAX   (0x7FFFU)

/* CDD_FSI_TX_LOCK_CTRL */

#define CSL_CDD_FSI_TX_CFG_TX_LOCK_CTRL_LOCK_MASK  (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_LOCK_CTRL_LOCK_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_LOCK_CTRL_LOCK_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_LOCK_CTRL_RESERVED_1_MASK  (0x00FEU)
#define CSL_CDD_FSI_TX_CFG_TX_LOCK_CTRL_RESERVED_1_SHIFT (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_LOCK_CTRL_RESERVED_1_MAX   (0x007FU)

#define CSL_CDD_FSI_TX_CFG_TX_LOCK_CTRL_KEY_MASK  (0xFF00U)
#define CSL_CDD_FSI_TX_CFG_TX_LOCK_CTRL_KEY_SHIFT (0x0008U)
#define CSL_CDD_FSI_TX_CFG_TX_LOCK_CTRL_KEY_MAX   (0x00FFU)

