TexasInstruments/mcal_am263x/mcal/FsiTx/V0/Cdd_FsiTx_Reg.h
/* RESERVED_3 */

/* CDD_FSI_TX_EVT_STS */

#define CSL_CDD_FSI_TX_CFG_TX_EVT_STS_FRAME_DONE_MASK  (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_STS_FRAME_DONE_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_STS_FRAME_DONE_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_EVT_STS_BUF_UNDERRUN_MASK  (0x0002U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_STS_BUF_UNDERRUN_SHIFT (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_STS_BUF_UNDERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_EVT_STS_BUF_OVERRUN_MASK  (0x0004U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_STS_BUF_OVERRUN_SHIFT (0x0002U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_STS_BUF_OVERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_EVT_STS_PING_TRIGGERED_MASK  (0x0008U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_STS_PING_TRIGGERED_SHIFT (0x0003U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_STS_PING_TRIGGERED_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_EVT_STS_RESERVED_1_MASK  (0xFFF0U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_STS_RESERVED_1_SHIFT (0x0004U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_STS_RESERVED_1_MAX   (0x0FFFU)

/* RESERVED_4 */

/* CDD_FSI_TX_EVT_CLR */

#define CSL_CDD_FSI_TX_CFG_TX_EVT_CLR_FRAME_DONE_MASK  (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_CLR_FRAME_DONE_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_CLR_FRAME_DONE_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_EVT_CLR_BUF_UNDERRUN_MASK  (0x0002U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_CLR_BUF_UNDERRUN_SHIFT (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_CLR_BUF_UNDERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_EVT_CLR_BUF_OVERRUN_MASK  (0x0004U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_CLR_BUF_OVERRUN_SHIFT (0x0002U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_CLR_BUF_OVERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_EVT_CLR_PING_TRIGGERED_MASK  (0x0008U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_CLR_PING_TRIGGERED_SHIFT (0x0003U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_CLR_PING_TRIGGERED_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_EVT_CLR_RESERVED_1_MASK  (0xFFF0U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_CLR_RESERVED_1_SHIFT (0x0004U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_CLR_RESERVED_1_MAX   (0x0FFFU)

/* CDD_FSI_TX_EVT_FRC */

#define CSL_CDD_FSI_TX_CFG_TX_EVT_FRC_FRAME_DONE_MASK  (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_FRC_FRAME_DONE_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_FRC_FRAME_DONE_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_EVT_FRC_BUF_UNDERRUN_MASK  (0x0002U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_FRC_BUF_UNDERRUN_SHIFT (0x0001U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_FRC_BUF_UNDERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_EVT_FRC_BUF_OVERRUN_MASK  (0x0004U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_FRC_BUF_OVERRUN_SHIFT (0x0002U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_FRC_BUF_OVERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_EVT_FRC_PING_TRIGGERED_MASK  (0x0008U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_FRC_PING_TRIGGERED_SHIFT (0x0003U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_FRC_PING_TRIGGERED_MAX   (0x0001U)

#define CSL_CDD_FSI_TX_CFG_TX_EVT_FRC_RESERVED_1_MASK  (0xFFF0U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_FRC_RESERVED_1_SHIFT (0x0004U)
#define CSL_CDD_FSI_TX_CFG_TX_EVT_FRC_RESERVED_1_MAX   (0x0FFFU)

/* CDD_FSI_TX_USER_CRC */

#define CSL_CDD_FSI_TX_CFG_TX_USER_CRC_USER_CRC_MASK  (0x00FFU)
#define CSL_CDD_FSI_TX_CFG_TX_USER_CRC_USER_CRC_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_USER_CRC_USER_CRC_MAX   (0x00FFU)

#define CSL_CDD_FSI_TX_CFG_TX_USER_CRC_RESERVED_1_MASK  (0xFF00U)
#define CSL_CDD_FSI_TX_CFG_TX_USER_CRC_RESERVED_1_SHIFT (0x0008U)
#define CSL_CDD_FSI_TX_CFG_TX_USER_CRC_RESERVED_1_MAX   (0x00FFU)

/* RESERVED_5 */

/* RESERVED_6 */

/* RESERVED_7 */

/* RESERVED_8 */

/* CDD_FSI_TX_ECC_DATA */

#define CSL_CDD_FSI_TX_CFG_TX_ECC_DATA_DATA_LOW_MASK  (0x0000FFFFU)
#define CSL_CDD_FSI_TX_CFG_TX_ECC_DATA_DATA_LOW_SHIFT (0x00000000U)
#define CSL_CDD_FSI_TX_CFG_TX_ECC_DATA_DATA_LOW_MAX   (0x0000FFFFU)

#define CSL_CDD_FSI_TX_CFG_TX_ECC_DATA_DATA_HIGH_MASK  (0xFFFF0000U)
#define CSL_CDD_FSI_TX_CFG_TX_ECC_DATA_DATA_HIGH_SHIFT (0x00000010U)
#define CSL_CDD_FSI_TX_CFG_TX_ECC_DATA_DATA_HIGH_MAX   (0x0000FFFFU)

/* CDD_FSI_TX_ECC_VAL */

#define CSL_CDD_FSI_TX_CFG_TX_ECC_VAL_ECC_VAL_MASK  (0x007FU)
#define CSL_CDD_FSI_TX_CFG_TX_ECC_VAL_ECC_VAL_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_ECC_VAL_ECC_VAL_MAX   (0x007FU)

#define CSL_CDD_FSI_TX_CFG_TX_ECC_VAL_RESERVED_1_MASK  (0xFF80U)
#define CSL_CDD_FSI_TX_CFG_TX_ECC_VAL_RESERVED_1_SHIFT (0x0007U)
#define CSL_CDD_FSI_TX_CFG_TX_ECC_VAL_RESERVED_1_MAX   (0x01FFU)

/* RESERVED_9 */

/* CDD_FSI_TX_DLYLINE_CTRL */

#define CSL_CDD_FSI_TX_CFG_TX_DLYLINE_CTRL_TXCLK_DLY_MASK  (0x001FU)
#define CSL_CDD_FSI_TX_CFG_TX_DLYLINE_CTRL_TXCLK_DLY_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_DLYLINE_CTRL_TXCLK_DLY_MAX   (0x001FU)

#define CSL_CDD_FSI_TX_CFG_TX_DLYLINE_CTRL_TXD0_DLY_MASK  (0x03E0U)
#define CSL_CDD_FSI_TX_CFG_TX_DLYLINE_CTRL_TXD0_DLY_SHIFT (0x0005U)
#define CSL_CDD_FSI_TX_CFG_TX_DLYLINE_CTRL_TXD0_DLY_MAX   (0x001FU)

#define CSL_CDD_FSI_TX_CFG_TX_DLYLINE_CTRL_TXD1_DLY_MASK  (0x7C00U)
#define CSL_CDD_FSI_TX_CFG_TX_DLYLINE_CTRL_TXD1_DLY_SHIFT (0x000AU)
#define CSL_CDD_FSI_TX_CFG_TX_DLYLINE_CTRL_TXD1_DLY_MAX   (0x001FU)

#define CSL_CDD_FSI_TX_CFG_TX_DLYLINE_CTRL_RESERVED_1_MASK  (0x8000U)
#define CSL_CDD_FSI_TX_CFG_TX_DLYLINE_CTRL_RESERVED_1_SHIFT (0x000FU)
#define CSL_CDD_FSI_TX_CFG_TX_DLYLINE_CTRL_RESERVED_1_MAX   (0x0001U)

/* RESERVED_10 */

/* CDD_FSI_TX_BUF_BASE */

#define CSL_CDD_FSI_TX_CFG_TX_BUF_BASE_BASE_ADDRESS_MASK  (0xFFFFU)
#define CSL_CDD_FSI_TX_CFG_TX_BUF_BASE_BASE_ADDRESS_SHIFT (0x0000U)
#define CSL_CDD_FSI_TX_CFG_TX_BUF_BASE_BASE_ADDRESS_MAX   (0xFFFFU)

#define CDD_FSI_TX_CTRL_REG_KEY ((uint16)0xA5U)

#ifdef __cplusplus
}
#endif
#endif /* #ifndef CDD_FSI_TX_REG_H_ */
